// 电话号
export const PHONE_REGEXP = /^(0|86|17951)?(13[0-9]|15[012356789]|17[3678]|18[0-9]|14[57]|19[0-9]|16[0-9])[0-9]{8}$/
// 固话
export const FIXED_PHONE_REGEXP = /^0\d{2,3}-[1-9]\d{6,7}$/
// 身份证
export const IDCARD_REGEXP = /^(^[1-9]\d{7}((0\d)|(1[0-2]))(([0|1|2]\d)|3[0-1])\d{3}$)|(^[1-9]\d{5}[1-9]\d{3}((0\d)|(1[0-2]))(([0|1|2]\d)|3[0-1])((\d{4})|\d{3}[Xx])$)$/
// 电子邮箱
export const EMAIL_REGEXP = /\w+([-+.]\w+)*@\w+([-.]\w+)*\.\w+([-.]\w+)*/
// 邮编
export const POSTCODE_REGEXP = /^[1-9]\d{5}(?!\d)$/
// 港澳居民居住证 810000：香港  820000：澳门  830000：台湾
export const GA_RESIDENT_PERMIT_REGEXP = /^8[12]0000(?:19|20)\d{2}(?:0[1-9]|1[0-2])(?:0[1-9]|[12]\d|3[01])\d{3}[\dX]$/
// 台湾居民居住证
export const T_RESIDENT_PERMIT_REGEXP = /^830000(?:19|20)\d{2}(?:0[1-9]|1[0-2])(?:0[1-9]|[12]\d|3[01])\d{3}[\dX]$/
